---
type: MEPBuildingConstruction
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 6
tags: [revit-api, class]
---

# MEPBuildingConstruction

`Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetBuildingConstruction | — | `public Construction GetBuildingConstruction ( ConstructionType constructionType )` |
| Method | GetBuildingConstructionOverride | 2013 | `public bool GetBuildingConstructionOverride ( ConstructionType constructionType )` |
| Method | GetConstructions | — | `public ICollection < Construction > GetConstructions ( ConstructionType constructionType )` |
| Method | SetBuildingConstruction | — | `public void SetBuildingConstruction ( ConstructionType constructionType , Construction buildingConstruction )` |
| Method | SetBuildingConstructionOverride | 2013 | `public void SetBuildingConstructionOverride ( ConstructionType constructionType , bool override )` |
| Property | Parameter | — | `` |